In [28]:
import pandas as pd

In [29]:
data = pd.read_csv('Dataset/currency.csv')

In [30]:
# To view entire data 
# print(data.to_string())

In [31]:
# To view first n rows 
print(data.head(8)) # type: ignore

  Code Symbol                      Name
0  AED    د.إ    United Arab Emirates d
1  AFN      ؋            Afghan afghani
2  ALL      L              Albanian lek
3  AMD    AMD             Armenian dram
4  ANG      ƒ  Netherlands Antillean gu
5  AOA     Kz            Angolan kwanza
6  ARS      $            Argentine peso
7  AUD      $         Australian dollar

In [32]:
# To view last n rows : 
print(data.tail(10))

    Code Symbol                    Name
153  VND      ₫         Vietnamese đồng
154  VUV     Vt            Vanuatu vatu
155  WST      T             Samoan tālā
156  XAF    CFA  Central African CFA fr
157  XCD      $   East Caribbean dollar
158  XOF    CFA  West African CFA franc
159  XPF     Fr               CFP franc
160  YER      ﷼             Yemeni rial
161  ZAR      R      South African rand
162  ZMW     ZK          Zambian kwacha

In [33]:
# To view more realistic view of our data we have to see random n no. of rows so : 
print(data.sample(15))

# everytime I run this command it generate me a random n no. of rows in this case 15 so to fix our output we give a random state

    Code Symbol                      Name
102  MZN     MT        Mozambican metical
4    ANG      ƒ  Netherlands Antillean gu
62   IDR     Rp         Indonesian rupiah
90   MDL    MDL              Moldovan leu
106  NOK     kr           Norwegian krone
82   KZT      ₸         Kazakhstani tenge
146  UAH      ₴         Ukrainian hryvnia
95   MOP      P           Macanese pataca
0    AED    د.إ    United Arab Emirates d
73   JPY      ¥              Japanese yen
126  SDG   ج.س.            Sudanese pound
42   EGP    EGP            Egyptian pound
38   DJF     Fr          Djiboutian franc
115  PLN     zł              Polish złoty
28   CDF     Fr           Congolese franc

In [34]:
print(data.sample(15,random_state=23))

    Code Symbol                 Name
96   MRU     UM  Mauritanian ouguiya
18   BOB    Bs.   Bolivian boliviano
64   IMP      £           Manx pound
19   BRL     R$       Brazilian real
142  TRY      ₺         Turkish lira
92   MKD    ден     Macedonian denar
117  PYG      ₲   Paraguayan guaraní
151  VEF   Bs F   Venezuelan bolívar
105  NIO     C$   Nicaraguan córdoba
63   ILS      ₪   Israeli new shekel
131  SOS     Sh      Somali shilling
88   LYD    ل.د         Libyan dinar
73   JPY      ¥         Japanese yen
58   HNL      L     Honduran lempira
67   IRR      ﷼         Iranian rial

In [35]:
# To view the column names 
data.columns

Index(['Code', 'Symbol', 'Name'], dtype='object')

In [36]:
# to view row names 
data.index

RangeIndex(start=0, stop=163, step=1)

In [37]:
#  to make a list of column names 
print(list(data.columns))

# or 
print(data.columns.tolist())
# similiarly for row

['Code', 'Symbol', 'Name']
['Code', 'Symbol', 'Name']

In [38]:
# to see shape i.e. rows,columns 
data.shape

(163, 3)

In [39]:
# to see number of elemenst 
data.size

489

In [40]:
# to get info
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163 entries, 0 to 162
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Code    163 non-null    object
 1   Symbol  163 non-null    object
 2   Name    163 non-null    object
dtypes: object(3)
memory usage: 3.9+ KB

In [41]:
data.describe()

       Code Symbol                    Name
count   163    163                     163
unique  163    107                     163
top     AED      $  United Arab Emirates d
freq      1     28                       1

## Accessing a particular column or cell 

### loc( ) & iloc( ): 
- The `loc()` function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. Also include last range of element passed .

In [42]:
# loc : label based indexing 

# Accesing rows for particular rows, col


# df.loc[row range, col range]


display(data.loc[3:10,"Symbol"])
# 10 will also included in result 



# at function is similiar only difference is it give only single value to us 

data.at[4,"Symbol"]

3      AMD
4        ƒ
5       Kz
6        $
7        $
8     Afl.
9      AZN
10      KM
Name: Symbol, dtype: object

'ƒ'

In [43]:
# based on some condition 
data.loc[(data.Code=='YER')]


# loc is used for getting data based on some condition .

    Code Symbol         Name
160  YER      ﷼  Yemeni rial

In [47]:
#  WE CAN Update the value like 
# update name to Yemen currency where code is YER

data.loc[(data.Code=="YER"),"Name"] = 'Yemeni currency'

data.loc[(data.Code=='YER')]

    Code Symbol             Name
160  YER      ﷼  Yemeni currency

In [45]:
# The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. 

 
# This method does not include the last element of the range passed in it


# selecting 0th, 2nd, 4th, and 7th index rows
(data.iloc[[0, 2, 4, 7]])




# iat() : similiar as iloc but for one value

  Code Symbol                      Name
0  AED    د.إ    United Arab Emirates d
2  ALL      L              Albanian lek
4  ANG      ƒ  Netherlands Antillean gu
7  AUD      $         Australian dollar

In [46]:
# selecting rows from 1 to 4 and columns from 2 to 4
(data.iloc[1: 5, 2: 5])

                       Name
1            Afghan afghani
2              Albanian lek
3             Armenian dram
4  Netherlands Antillean gu

In [65]:
# Instead of loc searching based on condition we can also do boolean based indexing 

data[data["Code"] == "AED"]

  Code Symbol                    Name
0  AED    د.إ  United Arab Emirates d